code-review/NRB_3471_3546/База_Было/Catalogs/УслугиТарифногоПлана.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>УслугиТарифногоПлана</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОпераций</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЮрФизЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРасчетаУслуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХранения1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХранения2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКомиссии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКомиссий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникУслуги</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыНачисленияКомиссий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграничениеСуммыНачисления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВБэкОфисе</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НДСКомиссии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсключатьПриОтбореПеречисленныеВидыЦБ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОтборПоМХ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>МестоХранения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтборПоВидуЦБ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидЦББанкаРоссии</Name>
							<Comment>Вид ценной бумаги банка РФ</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦББанкаРоссии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Enums/ВариантыНачисленияКомиссий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВариантыНачисленияКомиссий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПоручению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольнаяПериодичность</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Catalogs/УслугиТарифногоПлана/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Перем ПараметрыВладелец;
	Если Параметры.Свойство("ПараметрыВыбора",ПараметрыВладелец)  Тогда
		Если ПараметрыВладелец.Свойство("Владелец") Тогда
			Объект.Владелец = ПараметрыВладелец.Владелец;
		КонецЕсли;
	КонецЕсли;
	
	УстановитьОтбор();
	УправлениеДоступностью(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ЗаписатьНаборЗаписейНаСервере("Тарифы", "Услуга", ТекущийОбъект.Ссылка, Отказ);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УправлениеДоступностью(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипРасчетаПриИзменении(Элемент)
	УправлениеДоступностью(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПериодРасчетаПриИзменении(Элемент)
	
	Если Объект.ПериодРасчета = ПредопределенноеЗначение("Перечисление.ВариантыНачисленияКомиссий.ПоПоручению") Тогда
		Объект.ТипРасчета = ПредопределенноеЗначение("Перечисление.ТипыРасчетаУслуги.ПустаяСсылка");
	КонецЕсли;
	УправлениеДоступностью(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура МестоХранения1ПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.МестоХранения1) И Объект.ОтборПоМХ.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеПредупрежденияОбОчисткеТЧ", ЭтотОбъект);
		ПоказатьПредупреждение(Оповещение, "Табличная часть ""Отбор по МХ"" будет очищена");
	КонецЕсли;
	
	Элементы.ОтборПоМХ.Доступность = ЗначениеЗаполнено(Объект.МестоХранения1);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПредупрежденияОбОчисткеТЧ(Параметры) Экспорт
	
	Объект.ОтборПоМХ.Очистить();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТарифы


&НаКлиенте
Процедура ТарифыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ТекущиеДанные = Элементы.Тарифы.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			
			ТекущиеДанные.Период = ТекущаяДата();
			СтруктураТарифа = СтруктураТарифа(Объект.Ссылка);
			ТекущиеДанные.ТипТарифа  = СтруктураТарифа.ТипТарифа;
			ТекущиеДанные.Тариф      = СтруктураТарифа.Тариф;
			
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеДоступностью(Форма)
	
	ЭлементыФормы = Форма.Элементы;
	Объект = Форма.Объект;
	ЭлементыФормы.ТипРасчета.Доступность = НЕ (Объект.ПериодРасчета = ПредопределенноеЗначение("Перечисление.ВариантыНачисленияКомиссий.ПоПоручению"));
	ЭлементыФормы.Тарифы.Доступность = ЗначениеЗаполнено(Объект.Ссылка);
	ЭлементыФормы.ОтборПоМХ.Доступность = ЗначениеЗаполнено(Объект.МестоХранения1);
	ЭлементыФормы.СтраницаОтборПоВидуЦБ.Видимость = ДоступенОтборПоВидуЦББанкаРоссии(Объект.ТипРасчета);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СтруктураТарифа(Ссылка)
	
	Возврат  РегистрыСведений.Тарифы.ПолучитьПоследнее(ТекущаяДата(),Новый Структура("Услуга",Ссылка));
КонецФункции

&НаСервере
Процедура УстановитьОтбор()
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда	
		Набор = РеквизитФормыВЗначение("Тарифы");
		Набор.Отбор.Услуга.Установить(Объект.Ссылка);
		Набор.Прочитать();
		ЗначениеВРеквизитФормы(Набор, "Тарифы");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаборЗаписейНаСервере(ИмяЭлемента, ИмяПоля, ЗначениеОтбора, Отказ)
	
	Если Отказ Тогда
		Возврат;		
	КонецЕсли; 
	
	НаборЗначение = РеквизитФормыВЗначение(ИмяЭлемента);
	НаборЗначение.Отбор[ИмяПоля].Установить(ЗначениеОтбора);
	Для каждого ЗаписьНабора Из НаборЗначение Цикл
		ЗаписьНабора[ИмяПоля] = ЗначениеОтбора;		
	КонецЦикла; 
	
	Попытка
		НаборЗначение.Записать();
	Исключение
		МетаНабор = НаборЗначение.Метаданные();
		
		ОписаниеОшибки = ОписаниеОшибки();
		ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки
			, Отказ
			, "Элемент """ + СокрЛП(ЗначениеОтбора) + """ не записан. Не записан набор "+ МетаНабор.Синоним +".");			
	КонецПопытки;
			
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДоступенОтборПоВидуЦББанкаРоссии(ТипРасчета)
	Возврат РасчетТарифов.ДоступенОтборПоВидуЦББанкаРоссии(ТипРасчета);
КонецФункции


#КонецОбласти
